"""⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| 
                          GNU GENERAL PUBLIC LICENSE
                            Version 3, 29 June 2007
                            
        Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>
            Everyone is permitted to 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 verbatim copies
                of this license document, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.

                        ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝,
                        Telegram Music player userbot 
                has been licensed under GNU General Public License
            𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗦𝗼𝘂𝗹 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗟𝗮𝗯 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝘀
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|        
⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝"""
from ɖօօʍ_ʀօօʍ import *



'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def delay_sing_messages(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()



'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '  
async def xeronoid_raw_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()



'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_now_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_check_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_help_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_join_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_leave_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_mute_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_pause_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_replay_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_resume_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()        


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_next_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()       


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_end_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()        


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_unmute_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def xeronoid_volume_purge(xemsgs: tuple, slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete()        


'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| '
async def delete_server(xemsgs: tuple,slow: int):
    await asyncio.sleep(slow)
    for xemsg in xemsgs:
        await xemsg.delete() 
