"""⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| 
                          GNU GENERAL PUBLIC LICENSE
                            Version 3, 29 June 2007
                            
        Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>
            Everyone is permitted to 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 verbatim copies
                of this license document, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.

                        ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝,
                        Telegram Music player userbot 
                has been licensed under GNU General Public License
            𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗦𝗼𝘂𝗹 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗟𝗮𝗯 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝘀
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|        
⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝"""



import os
XERO = '⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝'
MAX_MIN = 8
MAX_HOUR = 3
BORNS = dict(root="Ӽɛʀօռօɨɖɮօȶ__ɖɛռ")
HORNS = dict(root="Ӽɛʀօռօɨɖ__ɦʊɮ")
HEROKU = os.environ.get('HEROKU', None)
xeroobj = object
WHITE_COMMANDK = '/'
DYNO_COMMANDK = '/'
if HEROKU is not None and HEROKU == "HEROKU":
    debuger_or_not = os.environ.get('NO').upper()
else:
    debuger_or_not = "no"





if HEROKU is not None and HEROKU == "HEROKU":
    CHAT_ID = int(os.environ.get('CHAT_ID', None))
else:
    CHAT_ID = [-1001561595012,-1001472203238, -1001549079508]
'|---------------------------------------------------------------------------|'
if HEROKU is not None and HEROKU == "HEROKU":
    OWNER_ID = int(os.environ.get('OWNER_ID', None))
else:
    OWNER_ID = [1848646989]
'|---------------------------------------------------------------------------|'
if HEROKU is not None and HEROKU == "HEROKU":
    MUSIC_ADMIN_IDS = int(os.environ.get('MUSIC_ADMIN_IDS', None))
else:
    MUSIC_ADMIN_IDS = [1848646989]
'|---------------------------------------------------------------------------|'
if HEROKU is not None and HEROKU == "HEROKU":
    BOT_USERNAME = os.environ.get('BOT_USERNAME')
else:
    BOT_USERNAME = "@XERONOIDBOT"
'|---------------------------------------------------------------------------|'
if HEROKU is not None and HEROKU == "HEROKU":
    LOGGER_ID = int(os.environ.get('LOGGER_ID'))
else:
    LOGGER_ID = (-1001513582173)



"""purge handlers' timings"""
RAW_REMOVER = 8
CURRENT_REMOVER = 12
GROUP_REMOVER = 8
INFO_REMOVER = 60
JOIN_REMOVER = 4
END_REMOVER = 4
MUTE_REMOVER = 6
PAUSE_REMOVER = 6
PLAY_REMOVER = 8
REPLAY_REMOVER = 6
RESUME_REMOVER = 6
SKIP_REMOVER = 2
STOP_REMOVER = 8
UNMUTE_REMOVER = 6
VOLUME_REMOVER = 6
SERVER_REMOVER = 12



"""Xeronoid Designer"""
XEXO = "一═••÷デ[ 🦋 Ӽɛʀօռօɨɖ 🦋 ]デ÷••═一 | by "
xerolink = "https://telegra.ph/file/25d6e03ed79350f5a545f.gif"
ON_OFF_FEED ="""
⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| 
                          GNU GENERAL PUBLIC LICENSE
                            Version 3, 29 June 2007
                            
        Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>
            Everyone is permitted to 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 verbatim copies
                of this license document, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.

                        ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝,
                        Telegram Music player userbot 
                has been licensed under GNU General Public License
            𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗦𝗼𝘂𝗹 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗟𝗮𝗯 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝘀
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|        
⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋 Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝"""