"""
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| 
⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝

                          GNU GENERAL PUBLIC LICENSE
                            Version 3, 29 June 2007
                            
        Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>
            Everyone is permitted to 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 verbatim copies
                of this license document, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.
                        ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝,
                        Telegram Music player userbot 
                has been licensed under GNU General Public License
            𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗦𝗼𝘂𝗹 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗟𝗮𝗯 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝘀
⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|        
"""
import os
XERO = '⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝'
MAX_MIN = 8
MAX_HOUR = 3
USERBOT_PLANEL = dict(root="Gҽɳҽɾαƚσɾʂ/xᴇʀᴏ_ʜᴀɴᴅʟᴇʀꜱ")
BOT_PLANEL = dict(root="Gҽɳҽɾαƚσɾʂ/xᴇʀᴏʙᴏᴛ_ʜᴀɴᴅʟᴇʀꜱ")
HEROKU = os.environ.get('HEROKU')
xeroobj = object

'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|'
if HEROKU == "HEROKU":
    DYNO_COMMANDK = os.environ.get('DYNO_COMMANDK')
else:
    DYNO_COMMANDK = "/"
if HEROKU == "HEROKU":
    CHAT_ID = set(int(x) for x in os.environ.get("CHAT_ID").split())
else:
    CHAT_ID = [-1001561595012,-1001472203238,-1001549079508]
if HEROKU == "HEROKU":
    OWNER_ID = os.environ.get('OWNER_ID')
else:
    OWNER_ID = [1848646989]
if HEROKU == "HEROKU":
    OWNER_USERNAME = os.environ.get('OWNER_USERNAME')
else:
    OWNER_USERNAME = '@HypeVoidSoul'
if HEROKU == "HEROKU":
    MUSIC_ADMIN_IDS = set(int(x) for x in os.environ.get("MUSIC_ADMIN_IDS").split())
else:
    MUSIC_ADMIN_IDS = [1650583471,1848646989] 
if HEROKU == "HEROKU":
    BOT_USERNAME = os.environ.get('BOT_USERNAME')
else:
    BOT_USERNAME = "@XERONOIDBOT"
if HEROKU == "HEROKU":
    LOGGER_ID = set(int(x) for x in os.environ.get("LOGGER_ID", "").split())
else:
    LOGGER_ID = (-1001513582173)
'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|'
CLEAN_REMOVER = 2
CURRENT_REMOVER = 8
GROUP_REMOVER = 6
HELP_REMOVER = 60
JOIN_REMOVER = 4
LEAVE_REMOVER = 4
MUTE_REMOVER = 8
PAUSE_REMOVER = 8
PLAY_REMOVER = 8
REPLAY_REMOVER = 8
RESUME_REMOVER = 8
SKIP_REMOVER = 4
STOP_REMOVER = 6
UNMUTE_REMOVER = 6
VOLUME_REMOVER = 6
SERVER_REMOVER = 12
'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|'
XEXO = "            **⇜⊷•♪ 🦋Ӽɛʀօռօɨɖ🦋 ♪•⊶⇝**\n`by` **🔥 ΉYPΣ VӨID LΛB 🔥**\n\n"
xerolink = "https://telegra.ph/file/cc35dba04ad629c0771b3.gif"
ON_OFF_FEED ="""
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••| 
⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝

                          GNU GENERAL PUBLIC LICENSE
                            Version 3, 29 June 2007
                            
        Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>
            Everyone is permitted to 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 verbatim copies
                of this license document, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.
                        ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝,
                        Telegram Music player userbot 
                has been licensed under GNU General Public License
            𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗦𝗼𝘂𝗹 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝗟𝗮𝗯 | 𝗛𝘆𝗽𝗲𝗩𝗼𝗶𝗱𝘀
⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝         |           ⇜⊷°•♪   🦋Ӽɛʀօռօɨɖ🦋   ♪•°⊶⇝
|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|        
"""
'|•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••|'

